src/Catalogs/инкСотрудники/инкСотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>инкСотрудники</name>
  <attributes>
    <name>Гражданство</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВыдан</name>
    <type>
      <types>CatalogRef.инкПодразделенияВыдачиДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>CatalogRef.инкВидыДокументовФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатныйПроект</name>
    <type>
      <types>CatalogRef.инкЗарплатныеПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетКодВычета</name>
    <type>
      <types>CatalogRef.инкВычетыНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетКодФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетНомерУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инвалид</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Иностранец</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительныйЛистПроцент</name>
    <type>
      <types>EnumRef.инкИсполнительныйЛистПроцент</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОблагаемыйДоходСНачалаГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаСтандартныхНалоговыхВычетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.инкПол</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Совместитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СовместительДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИностранца</name>
    <type>
      <types>EnumRef.инкСтатусыИностранцев</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРезидента</name>
    <type>
      <types>EnumRef.инкСтатусыРезидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныеУсловия</name>
    <type>
      <types>EnumRef.ТерриториальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСокращенное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоСотрудника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НалоговыеВычеты</name>
    <attributes>
      <name>ВычетНДФЛ</name>
      <type>
        <types>CatalogRef.инкВычетыНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РодственныеСвязи</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРодственнойСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоходСоСтраховыхВзносов</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоходСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсключениеДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НеиспользованныйОтпуск</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтпуска</name>
      <type>
        <types>EnumRef.инкВидыОтпуска</types>
      </type>
    </attributes>
    <attributes>
      <name>Дни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/инкГруппыВычетовПоНДФЛ/инкГруппыВычетовПоНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкГруппыВычетовПоНДФЛ</name>
  <enumValues>
    <name>Стандартные</name>
  </enumValues>
  <enumValues>
    <name>СтандартныеНаДетей</name>
  </enumValues>
  <enumValues>
    <name>Имущественные</name>
  </enumValues>
  <enumValues>
    <name>Социальные</name>
  </enumValues>
  <enumValues>
    <name>СоциальныеПоУведомлениюНО</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/инкСотрудники/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Контактаная информация:
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		ДополнительныеПараметрыКонтактнойИнформации = МодульУправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
		ДополнительныеПараметрыКонтактнойИнформации.ТипПомещения = "Офис";
		МодульУправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметрыКонтактнойИнформации);
	КонецЕсли;
	
	ФотоСотрудникаАдрес = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ФотоСотрудника");
	ОтобразитьФотоСотрудника();
	ЗаполнитьКадровыеДанные();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Контактаная информация:
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("СотрудникСсылка", Объект.Ссылка);
	ДанныеОбъекта.Вставить("Модифицированность",ЭтаФорма.Параметры.СотрудникМодифицирован);
	
	Закрыть(ДанныеОбъекта);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Контактаная информация:
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтаФорма.Параметры.СотрудникМодифицирован = ЭтотОбъект.Модифицированность;
	
	// Контактаная информация:
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ФотоСотрудникаАдрес) Тогда
		Если ЭтоАдресВременногоХранилища(ФотоСотрудникаАдрес) Тогда
	    	ТекущийОбъект.ФотоСотрудника = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ФотоСотрудникаАдрес));
		КонецЕсли;
	Иначе
		ТекущийОбъект.ФотоСотрудника = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтактнуюИнформацию(Результат)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформацию(Команда)      
	
	ЭтаФорма.ОбновитьОтображениеДанных();  
	ЗаполнитьКадровыеДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	НаименованиеПриИзмененииНаСервере();
	
КонецПроцедуры                          

&НаСервере
Процедура НаименованиеПриИзмененииНаСервере()

	СотрудникОбъект = РеквизитФормыВЗначение("Объект");	
	СотрудникОбъект.ЗаполнитьФИО(); 
	ЗначениеВРеквизитФормы(СотрудникОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ИмущественныйВычетКодВычетаОткрытие(Элемент, СтандартнаяОбработка)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ГруппаВычетаНДФЛ", ПолучитьИмущественнуюГруппуВычетовНаСервере());
	 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	 
	ОткрытьФорму("Справочник.инкВычетыНДФЛ.Форма.ФормаВыбора", ПараметрыФормы, Элементы.ИмущественныйВычетКодВычета);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУдостоверяющийЛичностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборВидыДокументовФизическихЛиц",ЭтаФорма);
	ОткрытьФорму("Справочник.инкВидыДокументовФизическихЛиц.Форма.ФормаВыбора",,ЭтотОбъект,ЭтотОбъект.УникальныйИдентификатор,,,ОписаниеВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОбработатьВыборВидыДокументовФизическихЛиц(РезультатЗакрытия,ДопПараметры) Экспорт

	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ДокументУдостоверяющийЛичность = РезультатЗакрытия;

КонецПроцедуры	

&НаКлиенте
Процедура ИННПриИзменении(Элемент)     
	
	ИННПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИННПриИзмененииНаСервере()

	инкКадровыйУчетСервер.ОбработатьОтображениеПоляИНН(Объект.ИНН,Элементы.ИНН,ЭтаФорма);

КонецПроцедуры   

&НаКлиенте
Процедура СНИЛСПриИзменении(Элемент)   

	СНИЛСПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура СНИЛСПриИзмененииНаСервере()

	инкКадровыйУчетСервер.ОбработатьОтображениеПоляСНИЛС(Объект.СНИЛС,Элементы.СНИЛС,ЭтаФорма);

КонецПроцедуры   
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьИмущественнуюГруппуВычетовНаСервере()
	
	Возврат Перечисления.инкГруппыВычетовПоНДФЛ.Имущественные;	
	
КонецФункции

#Область о //Отчеты:

&НаКлиенте
Процедура КадровыеДокументыСотрудника(Команда)
	
	УсловияОтбора = новый Структура();
	УсловияОтбора.Вставить("Сотрудник",Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", УсловияОтбора);
    
    ОткрытьФорму("ЖурналДокументов.инкКнигаКадровыхПриказов.ФормаСписка",ПараметрыФормы,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти 

#Область о //Стандартные подсистемы:

// СтандартныеПодсистемы.КонтактнаяИнформация

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.НачатьИзменение(ЭтотОбъект, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		
		ПараметрыОткрытия = Новый Структура;
		
		Отбор = Новый Структура("ИмяРеквизита", Элемент.Имя);
		Строки = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
		ДанныеСтроки = ?(Строки.Количество() = 0, Неопределено, Строки[0]);
		//Если ДанныеСтроки <> Неопределено Тогда
		//	ДобавитьСтрануВПараметрыОткрытия(ПараметрыОткрытия, ДанныеСтроки.Вид, Объект.СтранаРегистрации);
		//КонецЕсли;
		
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент,, СтандартнаяОбработка, ПараметрыОткрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.НачатьОчистку(ЭтотОбъект, Элемент.Имя);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда.Имя);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.НачатьОбработкуНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьОбновлениеКонтактнойИнформации(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьКонтактнуюИнформацию(Результат);
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#КонецОбласти 

#Область о // Фото сотрудника:

&НаСервере
Процедура ОтобразитьФотоСотрудника()
	
	мФотоОтображение = ПолучитьХТМЛКодКартинки();		
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьХТМЛКодКартинки() 
	
	ХТМЛКодКартинки = "";
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	ФотоСотрудникаХЗ = СправочникОбъект.ФотоСотрудника.Получить();
	Если ФотоСотрудникаХЗ <> Неопределено Тогда
		
		КодКартинки = Base64Строка(ФотоСотрудникаХЗ);
		ХТМЛКодКартинки = "<!DOCTYPE html>
	                       |<html dir=""ltr"">
	                       |<head>
	                       |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
	                       |<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
	                       |<meta name=""format-detection"" content=""telephone=no"" />
	                       |<style type=""text/css"">
	                       |body{margin:0;padding:8px;}
	                       |p{line-height:1.15;margin:0;white-space:pre-wrap;}
	                       |ol,ul{margin-top:0;margin-bottom:0;}
	                       |img{border:none;}
	                       |li>p{display:inline;}
	                       |</style>
	                       |</head>
	                       |<body>
	                       |<br>
	                       |<p><img src=""imageXXX"" style=""border:none;""/></p>
	                       |<br>
	                       |</body>
	                       |</html>
	                       |'";
		
		ХТМЛКодКартинки	= СтрЗаменить(ХТМЛКодКартинки, 
		            " src=""imageXXX""", 
					" src=""data:image/png;base64, " 
					+ КодКартинки + """" 
					);                
		
	КонецЕсли;
				
	Возврат ХТМЛКодКартинки;			
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьФото(Команда)

	Оповещение = Новый ОписаниеОповещения("ЗагрузитьКартинкуЗавершение", ЭтотОбъект);
    НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьКартинкуЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
    
    Если НЕ Результат Тогда
        Возврат;
    КонецЕсли;
    
    ФотоСотрудникаАдрес = Адрес;
    Модифицированность = Истина;
	ЭтотОбъект.Записать();
	ОтобразитьФотоСотрудника();
    
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФото(Команда)               
	
	ЭтотОбъект.ФотоСотрудникаАдрес = Неопределено;
	ЭтотОбъект.Записать();
	ОтобразитьФотоСотрудника();

КонецПроцедуры

#КонецОбласти

#Область о // Заполнение кадровых данных:

&НаСервере
Процедура ЗаполнитьКадровыеДанные()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;	
	КонецЕсли;
	
	ЭтотОбъект.Прочитать();
    
	КадровыеДанныеСотрудника = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(Объект.Ссылка,КонецМесяца(ТекущаяДата()));
	
	Для каждого ЭлементСтруктуры Из КадровыеДанныеСотрудника Цикл
		
		ИмяРеквизитаФормы = "кд"+ЭлементСтруктуры.Ключ;
		Если инкОбщийКлиентСервер.ЕстьСвойство(Элементы,ИмяРеквизитаФормы) Тогда
			ЭтаФорма[ИмяРеквизитаФормы] = ЭлементСтруктуры.Значение;	
		КонецЕсли;
				
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
